########################################
#      К О Р Т Е Ж   ( T U P L E )     #
########################################

# Кортеж — по сути это неизменяемый список,
# который мы можем хэшировать,
# а значит использовать в качестве ключа в словарях


#
## Задание кортежа.
#
print("\nЗадание кортежа")

empty_tuple = ()
empty_tuple = tuple()

one_element_tuple = (1,) # это кортеж из одного элемента, (!) внимание на запятую
one_element       = (1)  # это переменная int 

tup1 = 1, 2, 3
tup2 = (1, 2, 3)
tup1 == tup2      # True

tuple('abs')   # ('a', 'b', 'c')
tuple([1,2,3]) # (1, 2, 3)

# Кортеж нельзя изменять. Нельзя ни добавлять, не изменять, ни удалять
immutables = (int, str, tuple) # неизменяемые

# Это выдаст ошибку
#immutables[0] = float

# Но кортеж может содрежать изменяемы объекты
v = ([1, 2, 3], [3, 2, 1])
print(v)
v[0].append(7)
print(v)















